﻿/*
Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.
5, 25 -> да
-4, 16 -> да
25, 5 -> да
8,9 -> нет
*/
class Program015{

int firstNumber = Convert,ToInt32(Console.Readline());
int secondNumber = Convert,ToInt32(Console.Readline());
if(firstNumber*firstNumber==secondNumber||secondNumber*secondNumber==firstNumber){
Console.WriteLine("да");}else{
}}